# Homebrew additions
tap 'caskroom/cask'
tap 'homebrew/dupes'

#AVR Development repository
#tap 'osx-cross/avr'

#avr-lib
#brew 'avr-libc'
#brew 'avrdude'

# Homebrew apps
brew 'mas'
brew 'mogenerator'
brew 'carthage'
brew 'nmap'
brew 'tmux'

# Cask
cask 'appcode'
cask 'atom'
cask 'wwdc'
cask 'zeplin'
cask 'gitup'
cask 'vlc'
cask 'charles'
cask 'transmission'
cask 'telegram'
cask 'zoomus'
cask 'dropbox'
cask 'skype'
cask 'google-chrome'
cask 'steam'

#CAD stuff
#cask 'eagle'
#cask 'openscad'

#3D printing
#cask 'slic3r'
#cask 'printrun'

# AppStore
mas 'Slack', id: 803453959
mas 'Pomodoro One', id: 907364780
mas 'Easy APNs Provider', id: 989622350
mas 'The Unarchiver', id: 425424353
mas 'Twitter', id: 409789998
mas 'Pages', id: 409201541
