# Homebrew additions
tap 'homebrew/dupes'

#AVR Development repository
#tap 'osx-cross/avr'

#avr-lib
#brew 'avr-libc'
#brew 'avrdude'

# Homebrew apps
brew 'pyenv'
brew 'mas'
brew 'mogenerator'
brew 'carthage'
brew 'nmap'
brew 'tmux'
brew 'swiftlint'

# Cask
cask 'appcode'
cask 'atom'
cask 'wwdc'
cask 'zeplin'
cask 'gitup'
cask 'vlc'
cask 'charles'
cask 'transmission'
cask 'zoomus'
cask 'dropbox'
cask 'skype'
cask 'google-chrome'
cask 'firefox'
cask 'steam'
cask 'flux'
cask 'tunnelblick'
cask 'paw'
cask 'ganttproject'
cask 'enpass'

#CAD stuff
#cask 'eagle'
#cask 'openscad'
#cask 'sketchup'

#3D printing
#cask 'slic3r'
#cask 'printrun'

# AppStore
mas 'Slack', id: 803453959
mas 'Pomodoro One', id: 907364780
mas 'Easy APNs Provider', id: 989622350
mas 'The Unarchiver', id: 425424353
mas 'Twitter', id: 409789998
mas 'Pages', id: 409201541
mas 'Telegram', id: 747648890
