# Homebrew additions
tap 'homebrew/dupes'

# Vapor tap
tap 'vapor/homebrew-tap'

# AVR Development repository
#tap 'osx-cross/avr'

# avr-lib
#brew 'avr-libc'
#brew 'avrdude'

# swiftenv tap

# Homebrew apps
# brew 'pyenv'
brew 'mas'
brew 'mogenerator'
brew 'carthage'
brew 'nmap'
brew 'tmux'
brew 'swiftlint'
brew 'sourcery'
brew 'wakeonlan'
brew 'graphviz'
brew 'swiftenv'

# Cask
cask 'appcode'
cask 'visual-studio-code'
cask 'wwdc'
cask 'opensim'
# cask 'zeplin'
cask 'gitup'
cask 'vlc'
cask 'charles'
# cask 'transmission'
# cask 'dropbox'
cask 'skype'
cask 'google-chrome'
# cask 'firefox'
# cask 'steam'
cask 'flux'
cask 'tunnelblick'
cask 'paw'
# cask 'ganttproject'
cask 'tunnelbear'
cask 'reveal'
cask 'spotify'
cask 'twitch'

#Arduino
#cask 'arduino'

#CAD stuff
#cask 'eagle'
#cask 'openscad'
#cask 'sketchup'

#3D printing
#cask 'slic3r'
#cask 'printrun'

# AppStore
mas 'Slack', id: 803453959
mas 'Pomodoro One', id: 907364780
mas 'Easy APNs Provider', id: 989622350
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot 2 for Twitter', id: 557168941
mas 'Pages', id: 409201541
mas 'Telegram', id: 747648890
mas 'Enpass password manager', id: 732710998
mas 'Trello', id: 1278508951
